surfaceWater/runCases/LES_3D_zeroStart/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         320;

deltaT          0.01;

writeControl    runTime;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      fixed;

timePrecision   2;

/* Switch for whether dictionaries, e.g. controlDict, 
 are re-read during a simulation at the beginning of 
 each time step, allowing the user to modify parameters 
 during a simulation.*/
runTimeModifiable false;

/* Switch used by some solvers to adjust the time 
step during the simulation, usually according to maxCo*/
adjustTimeStep    true;
maxCo             1.0;

functions
{
  //Boundary stuff
  #includeFunc boundaryProbes

  //This will be used to calculate the reynold stress components
  //as k = 0.5(u_iu_i + u_ju_j + u_ku_k)
  fieldAverage4TKE
  {
    type            fieldAverage;
    libs            ("libfieldFunctionObjects.so");
    writeControl    writeTime;

    fields
    (
      U
      {
        mean        on;
        prime2Mean  on;
        base        time;
      }

      p
      {
        mean        on;
        prime2Mean  on;
        base        time;
      }
      
    );
  }
};

// ************************************************************************* //
