surfaceWater/runCases/LES_3D_zeroStart/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 8.44E-5;

boundaryField
{
    "(front|back|bottom)"
    {
        type    kqRWallFunction;
        value   uniform 8.44E-5;
    }

    "(right|left)"
    {
        type    cyclicAMI;
    }

    top
    {
        type    zeroGradient;
    }

}


// ************************************************************************* //
